-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Nov 30, 2024 at 12:10 AM
-- Server version: 5.7.24
-- PHP Version: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `flask_users2`
--

-- --------------------------------------------------------

--
-- Table structure for table `tbl_results`
--

CREATE TABLE `tbl_results` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `merged_text` text,
  `filename` varchar(255) DEFAULT NULL,
  `default_name` varchar(255) DEFAULT NULL,
  `cleaned_text` longtext,
  `word_frequencies` longtext,
  `wordcloud_path` varchar(255) NOT NULL,
  `unigram_plot_path` varchar(255) NOT NULL,
  `bigram_plot_path` varchar(255) NOT NULL,
  `trigram_plot_path` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `ner_results` json DEFAULT NULL,
  `keyword_results` text,
  `processing_type` text,
  `original_filename` text,
  `original_text` longtext
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tbl_results`
--

INSERT INTO `tbl_results` (`id`, `user_id`, `merged_text`, `filename`, `default_name`, `cleaned_text`, `word_frequencies`, `wordcloud_path`, `unigram_plot_path`, `bigram_plot_path`, `trigram_plot_path`, `created_at`, `ner_results`, `keyword_results`, `processing_type`, `original_filename`, `original_text`) VALUES
(447, 42, NULL, '34f31cb2-52f8-4e5e-948e-9033b1ac3bf8_a681baba-f32f-4574-a040-6948e51cc3f5_أحيت البوابة الوطنية للهوايات هاوي.txt', NULL, 'احيت البوابة الوطنية لهوايات هاوي احدي مبادرات برنامج جودة الحياة العديد من الهوايات والانشطة التقليدية والتراثية التي كانت رائجة في فترة من الفترات ومن ثم اختفت او قل استخدامها ومنها هواية الكتابة بالخط العربي التي تعتبر من ارقي الفنون التقليدية في العالم العربي والاسلامي حيث نجحت بوابة هاوي في تحفيز هواتها ودعمهم وتمكينهم من انشاء انديتهم الخاصة ضمنها\n\nفي مطلع العام اس ناصر الميمون وعبيد النفيعي نادي الخط العربي في البوابة الوطنية لهوايات هاوي اذ يقول النفيعي عن التاسيس خطرت لنا فكرة انشاء النادي من خلال البحث عن مظلة رسمية ترعي انشطة الخط العربي بمدينة الرياض وبعد الاطلاع علي هاوي وطريقة عملها طرحت الفكرة علي الاستاذ ناصر الميمون والذي ابدي موافقته لبدء باجراءات هذا النشاط المبارك وتنظيمه وتعزيز المشاركة فيه\n\nويهدف النادي الذي يتخذ من الرياض مقرا له الي نشر ثقافة الخط العربي ودعم وتشجيع الهواة مع المساهمة في الجهود الوطنية في توطين قطاع الفنون وابراز فن الخط العربي كخط جمالي تشكيلي\n\n ومنذ تسجيل النادي في البوابة تضاعف عد الاعضاء بحسب النفيعي الي اكثر من عضوا بعد ان كان العد في البداية لا يتجاوز الثلاثة اعضاء وهناك نمو متزايد وملحوظ ومع زيادة الانشطة التي نقدمها لجمهور يزداد عد الراغبين في التسجيل\n\nوحول الدعم الذي قدمته هاوي لنادي يقول النفيعي بوابة هاوي داعم رئيسي لنا بدءا من انشاء النادي وتسهيل وصول الراغبين في التسجيل الي توفير مساحات ومرافق الي تغطية كل المتطلبات لانشاء الفعاليات ودعمها ولا زلنا نطمح لمزيد مضيفا منذ انضمامنا الي هاوي اصبح هواة النادي اكثر تنظيما ويرغبون في المشاركات المتنوعة وحتي الجمهور المطلع ينظر لنادي ونشاطاته بنوع من الاهتمام خصوصا ان النادي له مرجعية وهي هاوي\n\n وينظم نادي الخط العربي العديد من ورش العمل خلال المناسبات الوطنية ويقيم معارض فنية خاصة بالخط العربي كما يعمل مستقبلا علي طرح برامج نوعية متخصة وتحق لمنتسبيها فوائد اجتماعية ومادية اضافة الي تاليف مناهج تعليمية موجهة لمختلف الفئات الراغبة في تعلم الخط العربي فضلا عن تنظيم ملتقي ومعرض سنوي حول الخط العربي\n', 'احيت:1,البوابة:3,الوطنية:4,لهوايات:2,هاوي:8,احدي:1,مبادرات:1,برنامج:1,جودة:1,الحياة:1,العديد:2,من:10,الهوايات:1,والانشطة:1,التقليدية:2,والتراثية:1,التي:3,كانت:1,رائجة:1,في:13,فترة:1,الفترات:1,ومن:1,ثم:1,اختفت:1,او:1,قل:1,استخدامها:1,ومنها:1,هواية:1,الكتابة:1,بالخط:2,العربي:10,تعتبر:1,ارقي:1,الفنون:2,العالم:1,والاسلامي:1,حيث:1,نجحت:1,بوابة:2,تحفيز:1,هواتها:1,ودعمهم:1,وتمكينهم:1,انشاء:3,انديتهم:1,الخاصة:1,ضمنها:1,مطلع:1,العام:1,اس:1,ناصر:2,الميمون:2,وعبيد:1,النفيعي:4,نادي:2,الخط:7,اذ:1,يقول:2,عن:3,التاسيس:1,خطرت:1,لنا:2,فكرة:1,النادي:6,خلال:2,البحث:1,مظلة:1,رسمية:1,ترعي:1,انشطة:1,بمدينة:1,الرياض:2,وبعد:1,الاطلاع:1,علي:3,وطريقة:1,عملها:1,طرحت:1,الفكرة:1,الاستاذ:1,والذي:1,ابدي:1,موافقته:1,لبدء:1,باجراءات:1,هذا:1,النشاط:1,المبارك:1,وتنظيمه:1,وتعزيز:1,المشاركة:1,فيه:1,ويهدف:1,الذي:2,يتخذ:1,مقرا:1,له:2,الي:6,نشر:1,ثقافة:1,ودعم:1,وتشجيع:1,الهواة:1,مع:1,المساهمة:1,الجهود:1,توطين:1,قطاع:1,وابراز:1,فن:1,كخط:1,جمالي:1,تشكيلي:1,ومنذ:1,تسجيل:1,تضاعف:1,عد:2,الاعضاء:1,بحسب:1,اكثر:2,عضوا:1,بعد:1,ان:2,كان:1,العد:1,البداية:1,لا:1,يتجاوز:1,الثلاثة:1,اعضاء:1,وهناك:1,نمو:1,متزايد:1,وملحوظ:1,ومع:1,زيادة:1,الانشطة:1,نقدمها:1,لجمهور:1,يزداد:1,الراغبين:2,التسجيل:2,وحول:1,الدعم:1,قدمته:1,لنادي:2,داعم:1,رئيسي:1,بدءا:1,وتسهيل:1,وصول:1,توفير:1,مساحات:1,ومرافق:1,تغطية:1,كل:1,المتطلبات:1,لانشاء:1,الفعاليات:1,ودعمها:1,ولا:1,زلنا:1,نطمح:1,لمزيد:1,مضيفا:1,منذ:1,انضمامنا:1,اصبح:1,هواة:1,تنظيما:1,ويرغبون:1,المشاركات:1,المتنوعة:1,وحتي:1,الجمهور:1,المطلع:1,ينظر:1,ونشاطاته:1,بنوع:1,الاهتمام:1,خصوصا:1,مرجعية:1,وهي:1,وينظم:1,ورش:1,العمل:1,المناسبات:1,ويقيم:1,معارض:1,فنية:1,خاصة:1,كما:1,يعمل:1,مستقبلا:1,طرح:1,برامج:1,نوعية:1,متخصة:1,وتحق:1,لمنتسبيها:1,فوائد:1,اجتماعية:1,ومادية:1,اضافة:1,تاليف:1,مناهج:1,تعليمية:1,موجهة:1,لمختلف:1,الفئات:1,الراغبة:1,تعلم:1,فضلا:1,تنظيم:1,ملتقي:1,ومعرض:1,سنوي:1,حول:1', 'static\\wordcloud_42_34f31cb2-52f8-4e5e-948e-9033b1ac3bf8.png', 'static\\unigram_plot_42_34f31cb2-52f8-4e5e-948e-9033b1ac3bf8.png', 'static\\bigram_plot_42_34f31cb2-52f8-4e5e-948e-9033b1ac3bf8.png', 'static\\trigram_plot_42_34f31cb2-52f8-4e5e-948e-9033b1ac3bf8.png', '2024-11-29 22:34:45', '[{\"label\": \"organization\", \"token\": \"البوابة الوطنية لهوايات هاوي\"}, {\"label\": \"organization\", \"token\": \"برنامج جودة الحياة\"}, {\"label\": \"location\", \"token\": \"العالم العربي والاسلامي\"}, {\"label\": \"organization\", \"token\": \"بوابة هاوي\"}, {\"label\": \"person\", \"token\": \"ناصر الميمون وعبيد النفيعي\"}, {\"label\": \"organization\", \"token\": \"نادي الخط العربي\"}, {\"label\": \"organization\", \"token\": \"البوابة الوطنية لهوايات هاوي\"}, {\"label\": \"location\", \"token\": \"الرياض\"}, {\"label\": \"organization\", \"token\": \"هاوي\"}, {\"label\": \"person\", \"token\": \"ناصر الميمون\"}, {\"label\": \"location\", \"token\": \"الرياض\"}, {\"label\": \"person\", \"token\": \"النفيعي\"}, {\"label\": \"organization\", \"token\": \"بوابة هاوي\"}, {\"label\": \"organization\", \"token\": \"هاوي\"}, {\"label\": \"organization\", \"token\": \"نادي الخط العربي\"}]', '[[\"\\u0627\\u0644\\u0639\\u0627\\u0644\\u0645 \\u0627\\u0644\\u0639\\u0631\\u0628\\u064a\", 0.6882], [\"\\u0648\\u0627\\u0644\\u0627\\u0633\\u0644\\u0627\\u0645\\u064a\", 0.6786], [\"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a \\u0648\\u062f\\u0639\\u0645\", 0.6766], [\"\\u0648\\u0627\\u0644\\u0627\\u0633\\u0644\\u0627\\u0645\\u064a \\u062d\\u064a\\u062b\", 0.6748], [\"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a \\u0628\\u0645\\u062f\\u064a\\u0646\\u0629\", 0.6727], [\"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a \\u0648\\u0627\\u0644\\u0627\\u0633\\u0644\\u0627\\u0645\\u064a\", 0.6722], [\"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a \\u0641\\u064a\", 0.6684], [\"\\u0628\\u0627\\u0644\\u062e\\u0637 \\u0627\\u0644\\u0639\\u0631\\u0628\\u064a\", 0.6663], [\"\\u0628\\u0645\\u062f\\u064a\\u0646\\u0629 \\u0627\\u0644\\u0631\\u064a\\u0627\\u0636\", 0.659], [\"\\u0627\\u0644\\u0639\\u0631\\u0628\\u064a \\u0641\\u0636\\u0644\\u0627\", 0.6553]]', 'clean_stem', NULL, 'أحيت البوابة الوطنية للهوايات \"هاوي\" إحدى مبادرات برنامج جودة الحياة، العديد من الهوايات والأنشطة التقليدية والتراثية التي كانت رائجة في فترة من الفترات ومن ثم اختفت أو قلّ استخدامها، ومنها هواية \"الكتابة بالخط العربي\" التي تعتبر من أرقى الفنون التقليدية في العالم العربي والإسلامي، حيث نجحت بوابة \"هاوي\" في تحفيز هواتها ودعمهم وتمكينهم من إنشاء أنديتهم الخاصة ضمنها.\n\nفي مطلع العام 2023، أسس ناصر الميمون وعبيد النفيعي نادي الخط العربي في البوابة الوطنية للهوايات \"هاوي\"، إذ يقول النفيعي عن التأسيس: \"خطرت لنا فكرة إنشاء النادي من خلال البحث عن مظلة رسمية ترعى أنشطة الخط العربي بمدينة الرياض، وبعد الاطلاع على \"هاوي\" وطريقة عملها طرحت الفكرة على الأستاذ ناصر الميمون والذي أبدى موافقته للبدء بإجراءات هذا النشاط المبارك وتنظيمه وتعزيز المشاركة فيه\".\n\nويهدف النادي الذي يتخذ من الرياض مقرًا له إلى نشر ثقافة الخط العربي، ودعم وتشجيع الهواة، مع المساهمة في الجهود الوطنية في توطين قطاع الفنون، وإبراز فن الخط العربي كخط جمالي تشكيلي.\n\n ومنذ تسجيل النادي في البوابة تضاعف عدد الأعضاء، بحسب النفيعي، إلى أكثر من 60 عضوًا بعد أن كان العدد في البداية لا يتجاوز الثلاثة أعضاء، وهناك نمو متزايد وملحوظ، ومع زيادة الأنشطة التي نقدّمها للجمهور يزداد عدد الراغبين في التسجيل.\n\nوحول الدعم الذي قدمته \"هاوي\" للنادي يقول النفيعي: \"بوابة هاوي داعم رئيسي لنا، بدءًا من إنشاء النادي وتسهيل وصول الراغبين في التسجيل، إلى توفير مساحات ومرافق، إلى تغطية كل المتطلبات لإنشاء الفعاليات ودعمها، ولا زلنا نطمح للمزيد\"، مضيفًا \"منذ انضمامنا إلى \"هاوي\" أصبح هواة النادي أكثر تنظيما ويرغبون في المشاركات المتنوعة وحتى الجمهور المطلع ينظر للنادي ونشاطاته بنوع من الاهتمام خصوصًا أن النادي له مرجعية وهي هاوي\".\n\n وينظم نادي الخط العربي العديد من ورش العمل خلال المناسبات الوطنية، ويقيم معارض فنية خاصة بالخط العربي، كما يعمل مستقبلًا على طرح برامج نوعية متخصصة وتحقق لمنتسبيها فوائد اجتماعية ومادية، إضافة إلى تأليف مناهج تعليمية موجهة لمختلف الفئات الراغبة في تعلم الخط العربي، فضلًا عن تنظيم ملتقى ومعرض سنوي حول الخط العربي.\n');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_users`
--

CREATE TABLE `tbl_users` (
  `id` int(11) NOT NULL,
  `first_name` varchar(50) DEFAULT NULL,
  `second_name` varchar(50) DEFAULT NULL,
  `major` varchar(255) DEFAULT NULL,
  `username` varchar(50) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `verification_token` varchar(255) DEFAULT NULL,
  `is_verified` tinyint(1) DEFAULT '0',
  `birthdate` date DEFAULT NULL,
  `country` varchar(100) DEFAULT NULL,
  `cv` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tbl_users`
--

INSERT INTO `tbl_users` (`id`, `first_name`, `second_name`, `major`, `username`, `email`, `password`, `verification_token`, `is_verified`, `birthdate`, `country`, `cv`) VALUES
(42, 'jana', 'sami', NULL, 'janasami2003', 'janaalsuhaibani2003@gmail.com', 'scrypt:32768:8:1$h50fjEOG5fZ2ht0j$e34cb3c078b20f1778b69745c789abe7f1c6ec0ac7902001a0d9fb5207eb12d1477cb8d07301285384d292c9c10b18a1aa95025f92141af9cb9374d7fccbd334', '214b7c36-3065-4eec-b10c-074b80bb8048', 1, NULL, NULL, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tbl_results`
--
ALTER TABLE `tbl_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `tbl_users`
--
ALTER TABLE `tbl_users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tbl_results`
--
ALTER TABLE `tbl_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=448;

--
-- AUTO_INCREMENT for table `tbl_users`
--
ALTER TABLE `tbl_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `tbl_results`
--
ALTER TABLE `tbl_results`
  ADD CONSTRAINT `tbl_results_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `tbl_users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
